sys/248.ejs

<?xml version="1.0" encoding="UTF-8"?>

<s:Envelope
    xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xs="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
    xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
    <s:Header>
        <wsse:Security>
           <wsse:UsernameToken wsu:Id="SecurityToken-C740D028-8F1D-C45F-E0407C0A04162BDD">
                <wsse:Username><%=username %></wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText"><%=Password %></wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
     </s:Header>
    <s:Body>
         <SYSSendMessage xmlns="https://sys.sagliknet.saglik.gov.tr/SYS/">
          
      <input>
                &lt;SYSMessage&gt;
                    &lt;messageGuid value="<%=messageGuid %>" /&gt;
                    &lt;messageType version="1" codeSystemGuid="0a9ba485-e7e0-4abb-9c86-0a14fd364bb8" code="248" value="Tütün Kullanimi Veri Seti" /&gt;
                    &lt;documentGenerationTime value="<%=documentGenerationTime %>" /&gt;
                    &lt;author&gt;
                        &lt;healthcareProvider version="1" codeSystemGuid="c3eade04-4f91-5dab-e043-14031b0ac9f9" code="<%=healthcareProviderCode %>" value="<%=healthcareProviderValue %>" /&gt;
                    &lt;/author&gt;
                    &lt;firmaKodu value="<%=firmaKodu %>" /&gt;
                    &lt;recordData&gt;
                                        &lt;TUTUN_KULLANIMI&gt;
                                            <%if(SIGARA_ADEDI!=-1){ %>
                                                &lt;SIGARA_ADEDI value="<%=SIGARA_ADEDI%>" /&gt;
                                            <% }%>
                                            <%if(SIGARA_ADEDI!=-1){ for(var i=0; i < BAGIMLI_OLDUGU_URUN.length; i++) {%>
                                                    &lt;BAGIMLI_OLDUGU_URUN_BILGISI&gt;
                                                         &lt;BAGIMLI_OLDUGU_URUN version="1" codeSystemGuid="5342dd3f-5606-47a1-b6be-4a4427a02f4a" code="<%=BAGIMLI_OLDUGU_URUN[i].KODU%>" value="<%=BAGIMLI_OLDUGU_URUN[i].ADI%>" /&gt;
                                                    &lt;/BAGIMLI_OLDUGU_URUN_BILGISI&gt;
                                                <% }%>
                                              
                                            <% }%>
                                                                                               
                                        &lt;/TUTUN_KULLANIMI&gt;





                                &lt;HASTA_TAKIP_BILGISI&gt;
                                    &lt;SYSTakipNo value="<%=SYSTakipNo%>" /&gt;
                                &lt;/HASTA_TAKIP_BILGISI&gt;
                                &lt;/recordData&gt;
                                &lt;/SYSMessage&gt;
                               </input>
                            </SYSSendMessage>
                            </s:Body>
                    </s:Envelope>